wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
// 0x03 AS3935 Lightning Detector
// 0x29 TSL45315 (Light)
// 0x29  Color
// 0x38 VEML6070 (Light)
// 0x39 TSL2561
// 0x3c Display
// 0x40 SI7021
// 0x48 4*AD converter ADS1115
// 0x4a GY49 or MAX44009 Light Sensor
// 0x50 PCF8583P
// 0x57 ATMEL732
// 0x68 DS3231 Clock
// 0x76 BME280
// 0x77 BME680 (also BMP180)


  Log.notice("Scanning i2c bus");
  Wire.begin(I2CSDA, I2CSCL);
  Wire.setClock(10000);

  // Try for DISPLAY
#if defined(BOARD_HELTEC)
  pinMode(16,OUTPUT);
  digitalWrite(16,LOW);
  delay(100);
  digitalWrite(16,HIGH);
#endif

  for(address = 1; address < 127; address++ ) {
    Log.verbose(F("Trying %d"),address);
    Wire.beginTransmission(address);
    error = Wire.endTransmission();

    if (error == 0) {
      Log.trace("I2C device found at address 0x%x",address);

      if (address == AS3935_ADDR) {
        as3935_found = as3935.begin();
        Log.notice(F("AS3935 found? %T"),as3935_found);
        if (as3935_found) {
          // initialize it
          // Are we indoor or outdoor?
          if (Bindoor) {
            as3935.setIndoorOutdoor(INDOOR);
          } else {
            as3935.setIndoorOutdoor(OUTDOOR);
          }
          // set default values (tune code later)
          as3935.maskDisturber(false);
          as3935.setNoiseLevel(1);
          as3935.watchdogThreshold(1);
          as3935.spikeRejection(2);
          as3935.lightningThreshold(5);
          as3935.tuneCap(0x0f);
          as3935.clearStatistics(true);
        }
      }

      if (address == 0x29) {
        tcs_found = tcs.begin();
        Log.notice(F("TCS found? %T"),tcs_found);

        if (!tcs_found) {
          lox_found = lox.begin();
          Log.notice(F("LOX found? %T"),lox_found);
        }
      }

      if (address == 0x39) {
        tsl2561 = Adafruit_TSL2561_Unified(address);
        tsl2561_found = tsl2561.begin();
        Log.notice("TSL2561 found? %T",tsl2561_found);
        if (tsl2561_found) {
          // init the sensor
          tsl2561.enableAutoRange(true);
          // tsl2561.setGain(TSL2561_GAIN_1X);
          tsl2561.setIntegrationTime(TSL2561_INTEGRATIONTIME_101MS);
        }
      }

      if (address == 0x38) {
        // VEML6070
        veml.begin(VEML6070_1_T);
        if (veml.readUV() != -1) {
          veml_found = true;
        }
        Log.notice(F("VEML6070 found? %T"), veml_found);
      }

      if (address == 0x3c) {
        u8x8_found = u8x8.begin();
        Log.notice("U8xu found? %T",u8x8_found);
        if (u8x8_found) {
          u8x8.clear();
          u8x8.setFont(u8x8_font_chroma48medium8_r);
          u8x8.setFlipMode(Bflipped);
        }
      }
      if (address == 0x40) {
        // SI7021
        si7021 = Adafruit_Si7021();
        si7021_found = si7021.begin();
        Log.notice("Si7021 found? %T",si7021_found);
      }
      if ((address >= 0x48) && (address <= 0x4b)) {
        ads1115 = Adafruit_ADS1115(address);
        ads1115.begin();
        ads1115_found = true;
        Log.notice(F("ADS1115 found at 0x%x"),address);
      }
      if (address == 0x76 || address == 0x77) {
        // BME280 or BME680
        bme680_found = bme680.begin(address);
        if (bme680_found) {
          bme680.setTemperatureOversampling(BME680_OS_8X);
          bme680.setHumidityOversampling(BME680_OS_2X);
          bme680.setPressureOversampling(BME680_OS_4X);
          bme680.setIIRFilterSize(BME680_FILTER_SIZE_3);
          bme680.setGasHeater(320, 150); // 320*C for 150 ms
          Log.notice("BME680 found? %T at 0x%x",bme680_found,address);
        } else {
          bme280_found = bme280.begin(address);
          Log.notice("BME280 found? %T at 0x%x",bme280_found,address);
        }
      }
    }
  }
  Log.notice("End scanning i2c bus");
}

void setup_serial() {
  delay(1000);
  Serial.begin(115200);
}

void setup_logging() {
  Log.begin(LOG_LEVEL_VERBOSE, &Serial);
  Log.setPrefix(printTimestamp);
  Log.setSuffix(printNewline);
  Log.verbose("Logging has started");
}

// we assume there is always a LED connected
void setup_led() {
  led.begin();
  led.show();
}

// setup PIR motion detector
void setup_pir() {
  pinMode(pirInput, INPUT);
  pirState = digitalRead(pirInput);
}

// read the config file and parse its data
void setup_readconfig() {
  SPIFFS.begin();
  File f = SPIFFS.open("/config.json","r");
  if (!f) {
    Log.error("Cannot open config file");
    return;
  }
  StaticJsonDocument<512> jsonBuffer;

 // Parse the root object
 // JsonObject root = jsonBuffer.parseObject(f);

 auto error = deserializeJson(jsonBuffer,f);
 if (error) {
   Log.error(F("Failed to read file %s"),error.c_str());
 }

 JsonObject root = jsonBuffer.as<JsonObject>();

 // Copy values from the JsonObject to the Config
   Smyname = root["myname"].as<String>();
   Bflipped = root["display"]["flipped"];
   display_what = root["display"]["content"];
   display_brightness=root["display"]["brightness"];
   Spass = root["network"]["pass"].as<String>();
   Sssid = root["network"]["ssid"].as<String>();
   Smqttserver = root["mqtt"]["server"].as<String>();
   Ssite = root["location"]["site"].as<String>();
   Sroom = root["location"]["room"].as<String>();
   Bindoor = root["location"]["indoor"];
   Smqttuser = root["mqtt"]["user"].as<String>();
   Smqttpass = root["mqtt"]["pass"].as<String>();
   Imqttport = root["mqtt"]["port"];
   as3935_input = root["as3935_input"];
   if (pirInput = root["motion"]) {
     pir_found = true;
   } else {
     pir_found = false;
   }

  f.close();
  SPIFFS.end();
}

boolean setup_wifi() {
  WiFi.persistent(false);
  WiFi.disconnect();
  delay(100);
  WiFi.mode(WIFI_STA);
#if defined(ARDUINO_ARCH_ESP8266)
  WiFi.hostname(Smyname);
#endif
  WiFi.begin(Sssid.c_str(), Spass.c_str());

  int retries = 0;
  while (WiFi.status() != WL_CONNECTED) {
    delay(1000);
    retries++;
    Log.error(F("Wifi.status() = %d"),WiFi.status());
    if (retries > 20) {
      Log.error(F("Cannot connect to %s"),Sssid.c_str());;
      return false;
    }
  }
  String myIP = String(WiFi.localIP().toString());
  String myMask = String(WiFi.subnetMask().toString());
  Log.verbose("Wifi connected as %s/%s",myIP.c_str(),myMask.c_str());
  return true;
}

