wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
  if (si7021_found) mqtt_publish(status,F("si7021_found"));
  if (bme280_found) mqtt_publish(status,F("bme280_found"));
  if (bme680_found) mqtt_publish(status,F("bme680_found"));
  if (tsl2561_found) mqtt_publish(status,F("tsl2561_found"));
  if (voltage_found) mqtt_publish(status,F("voltage_found"));
  if (u8x8_found) mqtt_publish(status,F("u8x8_found"));
  if (veml_found) mqtt_publish(status,F("veml_found"));
  if (lox_found) mqtt_publish(status,F("lox_found"));
  if (tcs_found) mqtt_publish(status,F("tcs_found"));
  if (ads1115_found) mqtt_publish(status,F("ads1115_found"));
  if (pir_found) mqtt_publish(status,F("pir_found"));
  if (as3935_found) {
    mqtt_publish(status, F("as3935_found"));
    publish_as3935();
  }
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish(F("status/ChipID"),(uint32_t)ESP.getChipId());
  mqtt_publish(F("status/ResetReason"),ESP.getResetReason().c_str());
  mqtt_publish(F("status/SdkVersion"),ESP.getSdkVersion());
  mqtt_publish(F("status/SketchSize"),ESP.getSketchSize());
  mqtt_publish(F("status/CycleCount"),ESP.getCycleCount());
#endif

}

void loop_publish_voltage(){
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish("voltage", (float)(ESP.getVcc() / 1000.0));
#endif
}

void loop_publish_tsl2561() {
  if (tsl2561_found) {
    sensors_event_t event;

    if (tsl2561.begin() && tsl2561.getEvent(&event)) {
      mqtt_publish("light",event.light);
    } else {
      Log.verbose("loop_publish_tsl2561: Sensor overloaded");
    }
  }
}

void loop_publish_bme280() {
  if (bme280_found) {
    mqtt_publish("temperature", bme280.readTemperature());
    mqtt_publish("airpressure", bme280.readPressure() / 100.0F);
    mqtt_publish("humidity", bme280.readHumidity());
  }
}

void loop_publish_bme680() {
  if (bme680_found && bme680.performReading()) {
    mqtt_publish("temperature", bme680.temperature);
    mqtt_publish("airpressure", bme680.pressure / 100.0F);
    mqtt_publish("humidity", bme680.humidity);
    mqtt_publish("airquality", bme680.gas_resistance / 1000.0F);
  }
}



void loop_publish_veml6070() {
  if (veml_found) {
    mqtt_publish("UV", veml.readUV());
  }
}

void loop_publish_si7021() {
  if (si7021_found) {
    mqtt_publish("temperature", si7021.readTemperature());
    mqtt_publish("humidity", si7021.readHumidity());
  }
}

void loop_publish_tcs34725() {
  if (tcs_found) {
    uint16_t r,g,b,c;
    tcs.getRawData(&r,&g,&b,&c);

    Log.verbose(F("TCS Color raw: R=%d G=%d B=%d C=%d"),r,g,b,c);
    uint16_t minval = min(min(r,g),b);
    uint16_t maxval = max(max(r,g),b);

    int d1 = abs(r-g);
    int d2 = abs(r-b);
    int d3 = abs(g-b);

    int maxdist = max(max(d1,d2),d3);
    int mindist = min(min(d1,d2),d3);

    if (maxdist > 40) {
      r = map(r,minval,maxval,0,255);
      g = map(g,minval,maxval,0,255);
      b = map(b,minval,maxval,0,255);
    }

    setled(r,g,b);
    Log.verbose(F("TCS Color adj: R=%d G=%d B=%d C=%d"),r,g,b,c);
  }
}

int loop_get_lox_distance() {
  if (lox_found) {
    VL53L0X_RangingMeasurementData_t measure;
    lox.rangingTest(&measure);
    if (measure.RangeStatus != 4) {
      return measure.RangeMilliMeter;
    }
  }
  return -1;
}

void lights_on(int dist) {
  bool x = false;

 if ((dist > 0) && (dist < 500))
    x = true;

  if (x == light_on)
    return;

  Log.verbose(F("Lights on? %T %d mm"),x,dist);

  light_on = x;

  if (x) {
    led.setPixelColor(0, led_current_color);
    led.show();
  } else {
    led_current_color = led.getPixelColor(0);
    led.clear();
    led.show();
  }

  if (u8x8_found) {
    if (x) {
      u8x8.setContrast(255);
    } else {
      u8x8.setContrast(display_brightness);
    }
  }
}

// read PIR if it exists
void loop_pir() {
  if (pir_found) {
    int pir_old = pirState;
    pirState = digitalRead(pirInput);
    // Low -> Low
    if (pir_old == LOW && pirState == LOW)
      return;
    // Low -> High
    if (pir_old == LOW && pirState == HIGH) {
      mqtt_publish("motion", "started");
    }

    // High -> High
    if (pir_old == HIGH && pirState == HIGH)
      return;
    // High -> Low
    if (pir_old == HIGH && pirState == LOW) {
      mqtt_publish("motion", "stopped");
    }
  }
}

static int noiseCount=0;
static int totalDisturberCount=0;
static int loopcount = 0;
void loop_as3935() {
  byte watchDogVal = as3935.readWatchdogThreshold();
  if (digitalRead(as3935_input) == HIGH) {
    lightningStatus intReason = (lightningStatus) as3935.readInterruptReg();
    if (intReason == NOISE_TO_HIGH) {
      Log.verbose(F("as3935: noise %d"),++noiseCount);
      byte noiseFloor = as3935.readNoiseLevel();
      if (noiseCount > 2 && noiseFloor < 7) {
        as3935.setNoiseLevel(++noiseFloor);
        Log.verbose(F("as3935: noiseFloor %d"),noiseFloor);
      }
    }
    if (intReason == DISTURBER_DETECT) {
      Log.verbose(F("as3935: disturber %d"),++totalDisturberCount);
      if (totalDisturberCount > 2) {
        if (watchDogVal < 10) {
          as3935.watchdogThreshold(++watchDogVal);
          Log.verbose(F("as3935: watchDogVal %d"),watchDogVal);
        } else {
          as3935.maskDisturber(true);
          Log.verbose(F("as3935: Disturbers masked"));
        }
      }
    }
    if (intReason == LIGHTNING) {
      byte distance = as3935.distanceToStorm();
      uint32_t energy = as3935.lightningEnergy();
      Log.notice(F("as3935: Lightning detected in %d km, energy %u"),distance,energy);
      mqtt_publish(F("lightning/distance"), distance);
      mqtt_publish(F("lightning/energy"), energy);
    }
  }
  if (++loopcount > 10000) {
    loopcount = 0;
    if (totalDisturberCount > 2 && watchDogVal > 2) {
      --totalDisturberCount;
      --watchDogVal;
      as3935.maskDisturber(false);
      as3935.watchdogThreshold(watchDogVal);
      Log.verbose(F("as3935: WatchDogVal %d"),watchDogVal);
    }
  }
}

void loop() {
  // put your main code here, to run repeatedly:
  client.loop();

  if (!client.connected()) {
    now = millis();
    if (now - lastReconnectAttempt > 5000) {
      lastReconnectAttempt = now;
      if (mqtt_reconnect()) {
        lastReconnectAttempt = 0;
      }
    }
  }
  client.loop();

#if defined(ARDUINO_ARCH_ESP32)
  esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, 10, 10);
#endif

  if (as3935_found) {
    loop_as3935();
  }

  // read sensors and publish values
  if (color_watch)
    loop_publish_tcs34725();
  client.loop();

  if ((millis() - last_transmission) > (transmission_delay * 1000)) {
  // Voltage
    loop_publish_voltage();
    client.loop();
    loop_publish_tsl2561();
    client.loop();
    loop_publish_bme280();
    client.loop();
    loop_publish_bme680();
    client.loop();
    loop_publish_veml6070();
    client.loop();
    loop_publish_si7021();
    client.loop();
    last_transmission = millis();
  }
  client.loop();
  if (pir_found)
    loop_pir();
  client.loop();

  if (lox_found) {
    int distance = loop_get_lox_distance();
    lights_on(distance);
  }
  client.loop();

  if (u8x8_found &&
      light_on &&
      (((millis() - last_display) > (1000*30)) ||
       (display_what == DISPLAY_DISTANCE) ||
       display_refresh
     )
    ) {
    char s[10];
    u8x8.setFont(u8x8_font_amstrad_cpc_extended_r);
    display_refresh = false;
    client.loop();
    switch(display_what) {
      case DISPLAY_TEMPHUM:
        if (bme280_found) {
          char h[10];
          snprintf(s, 9, "%.1f C", bme280.readTemperature());
          snprintf(h, 9, "%.1f %%", bme280.readHumidity());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 1, s);
          u8x8.draw2x2String(1, 4, h);
        }
        break;
      case DISPLAY_TEMPERATURE:
        if (bme280_found) {
          snprintf(s, 9, "%.1f C", bme280.readTemperature());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_HUMIDITY:
        if (bme280_found) {
          snprintf(s, 9, "%.1f %%", bme280.readHumidity());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_AIRPRESSURE:
        if (bme280_found) {
          snprintf(s, 9, "%d hPa", (int)(bme280.readPressure() / 100));
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_DISTANCE:
        if (lox_found) {
          int dist = loop_get_lox_distance();
          if (dist >= 0) {
            snprintf(s,9,"%d mm",dist);
          } else {
            snprintf(s,9,"---- mm");
          }
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
    }
    u8x8.setContrast(display_brightness);
    last_display = millis();
  }
  client.loop();

}
